server/app/controllers/videos_controller.rb

  def create
    @video = Video.new(video_params)
    if @video.save
---
INSERT INTO "videos" ("category_id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category_id", 2], ["title", "test"], ["created_at", "2022-11-06 14:07:37.366393"], ["updated_at", "2022-11-06 14:07:37.366393"]]